000019161129             PGM        PARM(&CUID)
000020161129             DCL        VAR(&CUID) TYPE(*DEC) LEN(5 0)
000100161129             DLTF       FILE(QTEMP/DETORD)
000200161129             MONMSG     MSGID(CPF0000)
000300161129             CRTDUPOBJ  OBJ(DETORD) FROMLIB(*LIBL) OBJTYPE(*FILE) +
000400161129                          TOLIB(QTEMP) NEWOBJ(DETORD) CST(*NO) +
000500161129                          TRG(*NO)
000501161129             OVRDBF     FILE(TMPDETORD) TOFILE(QTEMP/DETORD)
000600170131             CRTORD     CUID(&CUID)
