000100161129
000101161129             DLTF       FILE(QTEMP/DETORD)
000102161129             MONMSG     MSGID(CPF0000)
000200161129             CRTDUPOBJ  OBJ(DETORD) FROMLIB(*LIBL) OBJTYPE(*FILE) +
000300161129                          TOLIB(QTEMP) NEWOBJ(DETORD) CST(*NO) +
000400161129                          TRG(*NO)
000401161129             OVRDBF     FILE(TMPDETORD) TOFILE(QTEMP/DETORD)
000500161129             CALL       PGM(ORD100)
