000118161104       PROCESS APOST.
000119161104      ****************************************************************
000120161104      *                                                              *
000121161104      *    PROGRAMME: PRO201                                         *
000122161104      *                                                              *
000123161104      *                                                              *
000124161104      ****************************************************************
000125161104
000126161104       IDENTIFICATION DIVISION.
000127161104      *************************
000128161104
000129161104       PROGRAM-ID. PRO201.
000130161104       AUTHOR. FORUM AS/400.
000131161104
000132161104       ENVIRONMENT DIVISION.
000133161104      **********************
000134161104
000135161104       CONFIGURATION SECTION.
000136161104      *---------------------*
000137161104       SOURCE-COMPUTER. IBM-AS400.
000138161104       OBJECT-COMPUTER. IBM-AS400.
000139161104
000140161104       INPUT-OUTPUT SECTION.
000141161104      *--------------------*
000142161104       FILE-CONTROL.
000143161104
000144161104           SELECT PROVIDE1 ASSIGN DATABASE-PROVIDE1
000145161104                             ORGANIZATION INDEXED
000146161104                             ACCESS MODE  SEQUENTIAL
000147161104                             RECORD KEY   EXTERNALLY-DESCRIBED-KEY.
000149161104
000150161104           SELECT PRO201D  ASSIGN WORKSTATION-PRO201D
000151161104                           ORGANIZATION TRANSACTION
000152161104                           ACCESS       DYNAMIC
000153161104                           RELATIVE KEY RRN01
000154161104                           FILE STATUS IS A
000155161104                           CONTROL-AREA F-KEYS.
000156161104
000157161104       DATA DIVISION.
000158161104      ***************
000159161104
000160161104       FILE SECTION.
000161161104      *------------*
000162161104
000163161104       FD  PROVIDE1.
000164161104       01  PRO-REC.
000165161104           COPY DDS-FPROV IN PROVIDE1.
000166161104
000167161104       FD  PRO201D.
000168161104       01  PRO201D-REC         PIC X(366).
000169161104
000171161104       WORKING-STORAGE SECTION.
000172161104      *-----------------------*
000173161104
000178161104       01  CTL01-OUT.
000179161104           COPY DDS-CTL01-O    IN PRO201D.
000180161104       01  CTL01-IN.
000181161104           COPY DDS-CTL01-I    IN PRO201D.
000182161104
000183161104       01  SFL01-OUT.
000184161104           COPY DDS-SFL01-O    IN PRO201D.
000185161104       01  SFL01-IN.
000186161104           COPY DDS-SFL01-I    IN PRO201D.
000187161104
000188161104       01  FMT02-OUT.
000189161104           COPY DDS-FMT02-O    IN PRO201D.
000190161104       01  FMT02-IN.
000191161104           COPY DDS-FMT02-I    IN PRO201D.
000192161104
000193161104       01  PRID-WRK            LIKE PRID IN PRO-REC.
000197161104
000198161104       01  F-KEYS.
000199161104           05 F             PIC XX.
000200161104              88 F3         VALUE '03'.
000201161104              88 F12        VALUE '12'.
000202161104      *    ATTENTION PAGEDOWN = 90 AND PAGEUP = 91 ALWAYS ]
000203161104              88 PAGEDOWN   VALUE '90'.
000204161104
000205161104       01  END-OF-FILE          PIC X.
000206161104              88 EOF            VALUE 'E'.
000207161104              88 NOF            VALUE 'N'.
000208161104
000209161104       01  IND-ON           PIC 1       VALUE B'1'.
000210161104       01  IND-OFF          PIC 1       VALUE B'0'.
000211161104
000212161104       01  A PIC XX.
000213161104
000214161104       01  PANEL          PIC 9(2)    COMP-3    VALUE 1 .
000215161104       01  RRN01          PIC 9(4)    COMP-3.
000216161104       01  SAVRRN01       PIC 9(4)    COMP-3.
000217161104       01  SFLPAG         PIC 9(2)    COMP-3    VALUE 14.
000218161104       01  STEP01         PIC X.
000220161104       01  STEP02         PIC X.
000221161104       01  TELLER         PIC 9(3)    COMP-3.
000222161104
000223161104      * VARIABLES TO IDENTIFY THE PANEL STEP
000224161104       01  PRP              PIC X       VALUE 'P'.
000225161104       01  DSP              PIC X       VALUE 'D'.
000226161104       01  FKEY             PIC X       VALUE 'F'.
000227161104       01  CHK              PIC X       VALUE 'C'.
000228161104       01  ACT              PIC X       VALUE 'A'.
000229161104       01  LOAD             PIC X       VALUE 'L'.
000230161104
000231161104       PROCEDURE DIVISION.
000232161104      ********************
000233161104
000234161104        PRO201.
000235161104           PERFORM PGM-INIT
000236161104
000237161104           PERFORM UNTIL PANEL = 0
000238161104             EVALUATE PANEL
000239161104               WHEN 01
000240161104                 PERFORM PNL01
000241161104               WHEN 02
000242161104                 PERFORM PNL02
000243161104
000245161104
000246161104               WHEN OTHER
000247161104                 PERFORM PGM-END
000248161104             END-EVALUATE
000249161104           END-PERFORM
000250161104
000251161104           PERFORM PGM-END.
000252161104
000294161104
000295161104       PNL01.
000296161104
000297161104           EVALUATE STEP01
000298161104             WHEN PRP
000299161104               PERFORM PRP01
000300161104             WHEN LOAD
000301161104               PERFORM LOD01
000302161104             WHEN DSP
000303161104               PERFORM DSP01
000304161104             WHEN FKEY
000305161104               PERFORM FKEY01
000306161104             WHEN CHK
000307161104               PERFORM CHK01
000308161104             WHEN ACT
000309161104               PERFORM ACT01
000310161104           END-EVALUATE.
000311161104
000312161104      * PREPARE SUBFILE --------------------
000313161104       PRP01.
000314161104           MOVE IND-ON TO IN30
000315161104           MOVE IND-OFF TO IN31
000316161104           WRITE PRO201D-REC FROM CTL01-O FORMAT IS 'CTL01'
000317161104           END-WRITE
000318161104           MOVE IND-OFF TO IN30
000319161104           MOVE ZERO TO SAVRRN01
000320161104
000326161104
000331161104             READ PROVIDE1
000332161104                  AT END MOVE IND-ON TO IN80
000333161104             END-READ
000338161104             MOVE LOAD TO STEP01
000340161104
000343161104
000344161104      * LOAD SUBFILE   ---------------------
000345161104       LOD01.
000346161104           MOVE SAVRRN01 TO RRN01
000347161104           COMPUTE RRB01 IN CTL01-O = RRN01 + 1
000348161104           MOVE 0 TO TELLER
000349161104           MOVE 0 TO OPT01 IN SFL01-O
000350161104           PERFORM UNTIL IN80 = IND-ON
000351161104                         OR TELLER >= SFLPAG
000352161104               ADD 1 TO RRN01
000353161104               ADD 1 TO TELLER
000354161104               MOVE CORR FPROV    TO SFL01-O
000355161104               WRITE SUBFILE PRO201D-REC FROM SFL01-O
000356161104                             FORMAT IS 'SFL01'
000357161104               READ PROVIDE1
000358161104                    AT END MOVE IND-ON TO IN80
000359161104               END-READ
000363161104           END-PERFORM
000364161104           MOVE RRN01 TO SAVRRN01
000365161104           MOVE DSP TO STEP01
000366161104
000367161104      * DISPLAY PANEL  ---------------------
000368161104       DSP01.
000369161104
000370161104           IF SAVRRN01 = ZERO
000371161104              MOVE IND-OFF TO IN31
000372161104           ELSE
000373161104              MOVE IND-ON  TO IN31
000374161104           END-IF
000375161104           MOVE IND-ON  TO IN32
000376161104
000377161104           WRITE PRO201D-REC FORMAT IS 'KEY01'
000378161104           WRITE PRO201D-REC FROM CTL01-O FORMAT IS 'CTL01'
000379161104           READ PRO201D INTO CTL01-I FORMAT IS 'CTL01'
000380161104           MOVE IND-OFF TO IN35
000381161104           MOVE FKEY TO STEP01
000382161104
000383161104      * COMMAND KEYS (EXCEPT CONFIRMATION) ----
000384161104       FKEY01.
000385161104           EVALUATE TRUE
000386161104             WHEN F3
000387161104               MOVE 0   TO PANEL
000388161104               MOVE PRP TO STEP01
000389161104             WHEN F12
000390161104               SUBTRACT 1 FROM PANEL
000391161104               MOVE PRP TO STEP01
000392161104             WHEN PAGEDOWN
000393161104               MOVE LOAD TO STEP01
000394161104             WHEN OTHER
000395161104               MOVE CHK TO STEP01
000396161104           END-EVALUATE.
000397161104
000398161104      * CHECK DISPLAY  ---------------------
000399161104       CHK01.
000400161104           MOVE ACT TO STEP01
000401161104           MOVE IND-ON TO IN33
000402161104           READ SUBFILE PRO201D NEXT MODIFIED
000403161104                               INTO SFL01-I FORMAT IS 'SFL01'
000404161104                 AT END SET EOF TO TRUE
000405161104                 NOT AT END SET NOF TO TRUE
000406161104           END-READ
000407161104           PERFORM UNTIL EOF
000408161104             MOVE CORR SFL01-I TO SFL01-O
000409161104             IF OPT01 IN SFL01-I  NOT = 0
000410161104                  AND OPT01 IN SFL01-I NOT = 2
000411161104                  AND OPT01 IN SFL01-I NOT = 5
000412161104                MOVE IND-ON TO IN35 , IN34
000413161104                MOVE DSP TO STEP01
000414161104             END-IF
000415161104             REWRITE SUBFILE PRO201D-REC FROM SFL01-O
000416161104                  FORMAT IS 'SFL01'
000417161104             MOVE IND-OFF TO IN34
000418161104             READ SUBFILE PRO201D NEXT MODIFIED
000419161104                                 INTO SFL01-I FORMAT IS 'SFL01'
000420161104                   AT END SET EOF TO TRUE
000421161104                   NOT AT END SET NOF TO TRUE
000422161104             END-READ
000423161104           END-PERFORM
000424161104           MOVE IND-OFF TO IN33
000425161104      * PERFORM ACTION ---------------------
000426161104       ACT01.
000427161104             READ SUBFILE PRO201D NEXT MODIFIED
000428161104                                 INTO SFL01-I FORMAT IS 'SFL01'
000429161104                   AT END SET EOF TO TRUE
000430161104                   NOT AT END SET NOF TO TRUE
000431161104             END-READ
000432161104             IF NOF
000433161104                IF OPT01 IN SFL01-I = 2
000434161104                   MOVE 2   TO PANEL
000435161104                   MOVE CORR SFL01-I TO SFL01-O
000436161104                   MOVE 0   TO OPT01 IN SFL01-O
000437161104                   REWRITE SUBFILE PRO201D-REC FROM SFL01-O
000438161104                       FORMAT IS 'SFL01'
000439161104
000440161104                END-IF
000441161104                IF OPT01 IN SFL01-I = 5
000442161104                   MOVE PRID IN SFL01-I TO PRID-WRK
000443161104                   CALL "ART202" USING  PRID-WRK
000444161104                   MOVE CORR SFL01-I TO SFL01-O
000445161104                   MOVE 0   TO OPT01 IN SFL01-O
000446161104                   REWRITE SUBFILE PRO201D-REC FROM SFL01-O
000447161104                       FORMAT IS 'SFL01'
000448161104                END-IF
000449161104             ELSE
000450161104                MOVE DSP TO STEP01
000451161104             END-IF.
000452161104
000453161104       PNL02.
000454161104
000455161104             EVALUATE STEP02
000456161104               WHEN PRP
000457161104                 PERFORM PRP02
000458161104               WHEN DSP
000459161104                 PERFORM DSP02
000460161104               WHEN FKEY
000461161104                 PERFORM FKEY02
000462161104           END-EVALUATE.
000463161104
000464161104      * PREPARE PANEL 02 ---------------------
000465161104       PRP02.
000466161104           MOVE CORRESPONDING SFL01-I TO FMT02-O
000467161104           MOVE DSP TO STEP02
000468161104
000469161104      * DISPLAY PANEL 02 ---------------------
000470161104       DSP02.
000471161104
000472161104           WRITE PRO201D-REC FROM FMT02-O FORMAT IS 'FMT02'
000473161104           READ PRO201D INTO FMT02-I FORMAT IS 'FMT02'
000474161104           MOVE FKEY TO STEP02
000475161104
000476161104      * COMMAND KEYS (EXCEPT CONFIRMATION) 02 ----
000477161104       FKEY02.
000478161104             EVALUATE TRUE
000479161104               WHEN F3
000480161104                 MOVE 1   TO PANEL
000481161104                 MOVE PRP TO STEP02
000482161104                 MOVE PRP TO STEP01
000483161104               WHEN F12
000484161104                 SUBTRACT 1 FROM PANEL
000485161104                 MOVE PRP TO STEP02
000486161104                 MOVE DSP TO STEP01
000487161104               WHEN OTHER
000488161104                 SUBTRACT 1 FROM PANEL
000489161104                 MOVE PRP TO STEP02
000490161104           END-EVALUATE.
000491161104
000492161104        PGM-INIT.
000493161104           MOVE 1    TO PANEL
000494161104           MOVE PRP  TO STEP01
000495161104           MOVE PRP  TO STEP02
000496161104           OPEN INPUT PROVIDE1
000497161104                I-O   PRO201D.
000498161104
000499161104        PGM-END.
000500161104           CLOSE  PRO201D PROVIDE1
000501161104           STOP RUN.
